SELECT 
    Неисправности.ID_Неисправности, 
    Неисправности.Описание, 
    Неисправности.Дата_Регистрации, 
    Неисправности.ID_Клиента, 
    Неисправности.ID_Мастера, 
    Неисправности.ID_Гарантии,
    STRING_AGG(Запчасти_Неисправности.ID_запчасти, ', ') AS ID_Запчасти
FROM 
    Неисправности
LEFT JOIN 
    Запчасти_Неисправности ON Неисправности.ID_неисправности = Запчасти_Неисправности.ID_неисправности
GROUP BY 
    Неисправности.ID_Неисправности, 
    Неисправности.Описание, 
    Неисправности.Дата_Регистрации, 
    Неисправности.ID_Клиента, 
    Неисправности.ID_Мастера, 
    Неисправности.ID_Гарантии