SELECT 
    Неисправности.ID_Неисправности, 
    Неисправности.Описание, 
    Неисправности.Дата_Регистрации, 
    Неисправности.ID_Клиента, 
    Неисправности.ID_Мастера, 
    Неисправности.ID_Гарантии, 
    (
        SELECT 
            STUFF((
                SELECT ',' + CAST(Запчасти_Неисправности.ID_запчасти AS NVARCHAR(MAX))
                FROM Запчасти_Неисправности
                WHERE Запчасти_Неисправности.ID_неисправности = Неисправности.ID_неисправности
                FOR XML PATH(''), TYPE
            ).value('.', 'NVARCHAR(MAX)'), 1, 2, '')
    ) AS ID_запчасти
FROM 
    Неисправности